---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsAndLugsOnSwitchPanel
source: html/a6d96738-ee1f-b83c-9216-9ef42f490b1c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsAndLugsOnSwitchPanel Property

You can't connect to switchboard [Panel Name] because there aren't enough space and circuit [Circuit Name] is set to Feed Through Lugs. \nYou can increase the number of circuits to be greater than [Number] to connect through breakers or you can disconnect circuit and select Feed Through Lugs again.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughAvailSlotsAndLugsOnSwitchPanel { get; }
```